artillery.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - post:
        url: "/graphql"
        json:
          operationName: "UserQuery"
          query: "query { users { id, name } }"
          variables: null